## DecisionTree
*Decision Tree is used for Regression and Classification Both*

In [1]:
#Read Data
import pandas as pd
df = pd.read_csv("/Learning/Python/JupyterNotebooks/py-master/ML/9_decision_tree/salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [2]:
inputs = df.drop(['salary_more_then_100k'],axis=1)
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [3]:
target = df['salary_more_then_100k']
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [5]:
# here in input variable all the columns are text so convert it to number using encoder
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job     = LabelEncoder()
le_degree  = LabelEncoder()
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n']     = le_job.fit_transform(inputs['job'])
inputs['degree_n']  = le_degree.fit_transform(inputs['degree'])
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [6]:
# now drop text column
inputs.drop(['company','job','degree'],axis=1,inplace=True)
inputs.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [9]:
#split data into train test
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs,target, test_size=0.25)
print(x_train)
print(x_test)

    company_n  job_n  degree_n
8           0      0         0
3           2      0         1
10          1      2         0
13          1      0         1
7           0      1         0
12          1      0         0
1           2      2         1
0           2      2         0
6           0      2         1
5           2      1         1
15          1      1         1
4           2      1         0
    company_n  job_n  degree_n
2           2      0         0
9           0      0         1
11          1      2         1
14          1      1         0

In [11]:
#create model
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model.fit(x_train,y_train)
model.score(x_test,y_test)

0.5

In [19]:
#Predict
predict = model.predict(x_test)
predict

array([0, 0, 1, 1])

In [20]:
#merge actual data with predicted data
final_merged_df = pd.concat([x_test,y_test],axis=1)
final_merged_df['predicated'] = predict
final_merged_df

    company_n  job_n  degree_n  salary_more_then_100k  predicated
2           2      0         0                      1           0
9           0      0         1                      1           0
11          1      2         1                      1           1
14          1      1         0                      1           1